In [2]:
# Import Pandas and Numpy Libraries
import pandas as pd
import numpy as np

In [3]:
# Create a dictionary with a list of grades associated with each name
grades_dict= {'Walley':[87,96,70], 'Eva':[100,87,90], 'Sam':[94,77,90],'Katie':[100,81,82],'Bob':[83,65,85]}

In [4]:
# Create a DataFrame, where each column is a Series
grades = pd.DataFrame(grades_dict)

In [5]:
# Display the DataFrame
grades

   Walley  Eva  Sam  Katie  Bob
0      87  100   94    100   83
1      96   87   77     81   65
2      70   90   90     82   85

In [6]:
# Create a dictionary, but with some missing values.
grades_dict = {'Walley':[87,96,70], 'Eva':[100,np.nan,90], 'Sam':[94,77,90],'Katie':[100,np.nan,np.nan],'Bob':[83,65,np.nan]}

In [7]:
# Create a DataFrame using the dictionary
grades = pd.DataFrame(grades_dict)

In [8]:
# Display the DataFrame
grades

   Walley    Eva  Sam  Katie   Bob
0      87  100.0   94  100.0  83.0
1      96    NaN   77    NaN  65.0
2      70   90.0   90    NaN   NaN

In [9]:
# Remove rows with at least one missing value
grades.dropna()

   Walley    Eva  Sam  Katie   Bob
0      87  100.0   94  100.0  83.0

In [10]:
# Remove columns with at least one missing value
grades.dropna(axis = 1)

   Walley  Sam
0      87   94
1      96   77
2      70   90

In [11]:
# Keep only the columns with at least 3 non-missing values
grades.dropna(axis = 1, thresh = 3)

   Walley  Sam
0      87   94
1      96   77
2      70   90

In [12]:
# Replace missing values with 'YYY'
grades.fillna(value ='YYY')

   Walley    Eva  Sam  Katie   Bob
0      87  100.0   94  100.0  83.0
1      96    YYY   77    YYY  65.0
2      70   90.0   90    YYY   YYY

In [13]:
# Replace Bob's missing values with Bob's average grade
grades['Bob'].fillna(value = grades['Bob'].mean())

0    83.0
1    65.0
2    74.0
Name: Bob, dtype: float64

## Self Practice Exercises

1) Drop all the rows with missing value(s).

In [14]:
grades.dropna()

   Walley    Eva  Sam  Katie   Bob
0      87  100.0   94  100.0  83.0

2) Fill the missing values of row index 2 using the median value of that row.

In [15]:
grades.fillna(value = grades.iloc[2].median())

   Walley    Eva  Sam  Katie   Bob
0      87  100.0   94  100.0  83.0
1      96   90.0   77   90.0  65.0
2      70   90.0   90   90.0  90.0

3) Display the values of grades, you will notice that the values are still the same as per the original values. Explore the parameters to see how you can commit the dropping of the missing values. Drop all the rows with missing value(s). Display grades to confirm that you can only see 1 row after the dropping.

In [20]:
# NOTE: THIS METHOD DOESNT ALWAYS WORK
grades = grades.dropna()
grades

   Walley    Eva  Sam  Katie   Bob
0      87  100.0   94  100.0  83.0

In [22]:
# Another method
# inplace ensures whatever you do actually updates original dataframe
grades = pd.DataFrame(grades_dict)
grades.dropna(inplace = True)
grades

   Walley    Eva  Sam  Katie   Bob
0      87  100.0   94  100.0  83.0

In [29]:
# to drop NA values by column
grades = pd.DataFrame(grades_dict)
grades.dropna(axis = 1, inplace = True)
grades

   Walley  Sam
0      87   94
1      96   77
2      70   90

reset the grades to the original DataFrame and try out the isnull function (```isnull()```) to find how many values are missing in each column and then in each row

In [24]:
grades = pd.DataFrame(grades_dict)
grades.isnull()

   Walley    Eva    Sam  Katie    Bob
0   False  False  False  False  False
1   False   True  False   True  False
2   False  False  False   True   True

4) How many values are missing in each column

In [27]:
# since True = 1 and False = 0, you can use sum()
# default: sum adds rows together (column-wise sum)
grades.isnull().sum()

Walley    0
Eva       1
Sam       0
Katie     2
Bob       1
dtype: int64

5) How many  values are misisng in each row

In [28]:
# axis = 1: sums columns together (row-wise sum)
grades.isnull().sum(axis = 1)

0    0
1    2
2    2
dtype: int64